// Задача 25. напишите цикл, который на вход принимает два числа (А и В)
// и возводит число А в натуральную степень В.
// 3,5 -> 243 (3")
// 2,4-> 16


// Console.Write("Введи число A: ");
// int A = int.Parse(Console.ReadLine()!);
// Console.Write("Введи число B: ");
// int B = int.Parse(Console.ReadLine()!);
// int N = 1;
// Console.WriteLine($"Число  А  в степени B рaвно {GetMultiplay(N)}");


// // --------------------------методы------------------------


// int GetMultiplay(int N){
//     int m = 1;
//     for(int i = 1; i <= B; i++)
//     {
//         m = m * A;
//     }
//     return m;
// }


// Задача 27. напишите программу, которая принимает на вход число
// и выдаёт сумму цифр в числе

// Console.Write("Введи число : ");
// int A = int.Parse(Console.ReadLine()!);

// Console.WriteLine($"Сумма цифр в числе {A} равна {GetSum()}");

//  ------------методы-------------









// Задача 29. напишите программу, которая задаёт массив из 8 элементов
// и выводит их на экран. (числа берём любые)


// ------------------------методы--------------------------------


// int[] GetArray(int size)
// {
//     int[] mArray = new int[size];
//     for (int i = 0; i < size; i++)
//     {
//         mArray [i] = new Random().Next(8);
//     }
//     return mArray;
// }
// int[] mArray = GetArray(8);
// Console.Write($"[{String.Join(' ', mArray)}]");
